Show / Hide Table of Contents
Class Stirrup
Stirrup
Inheritance
System.Object
OpenObject
Stirrup
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Services.Concrete.ReinforcedSection.OneStirrup,CI.ReinforcedSection")]
public class Stirrup : OpenObject
Constructors
Improve this Doc   View Source
Stirrup()
Constructor
Declaration
public Stirrup()
Properties
Improve this Doc   View Source
AnchorageLenght
Anchorage Lenght
Declaration
public double AnchorageLenght { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Diameter
Diameter
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiameterOfMandrel
Radius of stirrup mandrel - refering to stirrup axis
Declaration
public double DiameterOfMandrel { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Distance
Longitudinal distance between stirrups
Declaration
public double Distance { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Geometry
Geometry
Declaration
public PolyLine2D Geometry { get; set; }
Property Value
 Type |  Description
 PolyLine2D
Improve this Doc   View Source
IsClosed
Open / Closed stirrup
Declaration
public bool IsClosed { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Material
Material
Declaration
public ReferenceElement Material { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
ShearCheck
Status of shear check, not possible for detailing stirrup
Declaration
public bool ShearCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
TorsionCheck
Status of torsion check, not possible for detailing stirrup
Declaration
public bool TorsionCheck { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source